<?php

use App\Article;
use Illuminate\Database\Seeder;

class AddDataToTableArticles extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $dataArray =[
            [
                'title' => 'Заголовок статті - 1',
                'description' => 'Не дуже довгий текст, що описує дану статтю, але трішки об`єму має бути, інакше не гарно виглядає.',
                'text' => 'Текст статті. Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів. 
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                ',
                'order' => 0,
                'author' => 'Автор статті',
            ],
            [
            'title' => 'Заголовок статті - 2',
            'description' => 'Не дуже довгий текст, що описує дану статтю, але трішки об`єму має бути, інакше не гарно виглядає.',
            'text' => 'Текст статті. Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів. 
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                ',
            'order' => 1,
            'author' => 'Автор статті',
        ],
            [
                'title' => 'Заголовок статті - 3',
                'description' => 'Не дуже довгий текст, що описує дану статтю, але трішки об`єму має бути, інакше не гарно виглядає.',
                'text' => 'Текст статті. Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів. 
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                Так це має бути довгий текст, тому для прикладу, повторимо цей фрагмент декілька разів.
                ',
                'order' => 2,
                'author' => 'Автор статті',
            ]
        ];

        foreach ($dataArray as $item) {
            Article::insert([
                'title' => $item['title'],
                'description' => $item['description'],
                'text' => $item['text'],
                'author' => $item['author'],
                'order' => $item['order'],
            ]);
        }
    }
}
